// Задача 27: Напишите программу, которая принимает на вход число и выдаёт the sum of the numbers among.
//452 -> 11
//82 -> 10
//9012 -> 12
/*
int Dig (int n)
{
     int temp = n, rem=0, sum=0; 
    for (; n>0 ;   ) 
        {                       // 75457
            rem = n % 10; 
            n = n / 10; // нашли последнее число 7-5-4-5-4-7
            sum=sum+rem;
           // нашли число в обратном порядке .... 7-75-754-7545-75457 
  
        }
        return sum;

}

Console.Write ("Insert number: ");
int num=Convert.ToInt32(Console.ReadLine());

Console.WriteLine("The sum og the numbers among: " + Dig(num));
/*/

// !Задача 29: Напишите программу, которая задаёт массив из m элементов и выводит их на экран.
//1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

int [] arr = 
int ( )




Console.Write ("Insert number: ");
int num=Convert.ToInt32(Console.ReadLine());

Console.WriteLine("The sum og the numbers among: " + Dig(num));
